# İleri Birleştirme İşlemleri

In [1]:
#birebir birleştirme

In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({'calisanlar' : ['Ali', 'Veli', 'Ayse', 'Fatma'],
                   'grup' : ['Muhasebe', 'Mühendislik', 'Mühendislik', 'İK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3      Fatma           İK

In [4]:
df2 = pd.DataFrame({'calisanlar' : ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris' : [2010, 2009, 2014, 2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [5]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse  Mühendislik       2010
3      Fatma           İK       2019

In [6]:
#alternatif

In [7]:
pd.merge(df1,df2,on = 'calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse  Mühendislik       2010
3      Fatma           İK       2019

In [8]:
#çoktan teke (many-to-one)

In [9]:
df3 = pd.merge(df1,df2)

In [10]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse  Mühendislik       2010
3      Fatma           İK       2019

In [11]:
df4 = pd.DataFrame({'grup' : ['Muhasebe', 'Mühendislik', 'İK'],
                    'mudur' : ['Caner', 'Mustafa', 'Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK  Berkcan

In [12]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Mühendislik       2014  Mustafa
2       Ayse  Mühendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [13]:
#Çoktan çoka(many-to-many)

In [14]:
df5 = pd.DataFrame({'grup' : ['Muhasebe', 'Muhasebe', 'Mühendislik', 'Mühendislik', 'İK', 'İK'],
                    'yetenekler' : ['matematik', 'excel', 'kodlama', 'linux', 'excel', 'yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Mühendislik    kodlama
3  Mühendislik      linux
4           İK      excel
5           İK    yonetim

In [15]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3      Fatma           İK

In [16]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Mühendislik    kodlama
3       Veli  Mühendislik      linux
4       Ayse  Mühendislik    kodlama
5       Ayse  Mühendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim